# 运算法则
print('1+1=', 1 + 1)  # 加法运算
print('1-1=', 1 - 1)  # 减法运算
print('3*4=', 3 * 4)  # 乘法运算
print('11/2=', 11 / 2)  # 除法运算
print('11//2=', 11 // 2)  # 5，整除运算
print('11%2=', 11 % 2)  # 1，取余运算
print('2**2=', 2 ** 2)  # 指数运算，2的2次方
print('2**3=', 2 ** 3)  # 指数运算，2的3次方

print('=' * 30)

# 一正一负
print('9 // 4=', 9 // 4)  # 2
print('-9 // -4=', -9 // -4)  # 2

print('9 // -4=', 9 // -4)  # -3
print('-9 // 4=', -9 // 4)  # -3 一正一负的整数公式，向下取整

print('9 % -4=', 9 % -4)  # -3    公式  余数=被除数-余数*商      9-（-4）*（-3） 9-12 --> -3
print('-9 % 4=', -9 % 4)  # 3                                 -9-4*(-3)   -9+12 --> 3
